In [2]:
#Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [28]:
players_salaries_csv = "players_salaries.csv"
nba_stats_csv = "nba_stats.csv"

players_salaries_df = pd.read_csv(players_salaries_csv)
nba_stats_df = pd.read_csv(nba_stats_csv)

#players_salaries_df.columns
reduced_salaries = players_salaries_df[["Name", "Salary"]]
reduced_salaries.head()

             Name   Salary
0  Juhann Begarin      nan
1    Jaylen Brown 26758928
2       Kris Dunn  5005350
3  Carsen Edwards  1782621
4      Tacko Fall      nan

In [29]:
pd.options.display.float_format = '{:.0f}'.format
reduced_salaries["Salary"].describe()
#Google search says the average salary = $7.3 million; the top 10 highest salaries
#are north of $39 million (i.e. LeBron James and Kevin Durant)
#possibly higher b/c of trades and multiple listings of players and sal per trade

count        445
mean     8813696
std      9886777
min       925258
25%      1802057
50%      4447896
75%     12000000
max     45780966
Name: Salary, dtype: float64

In [25]:
#nba_stats_df.columns
reduced_nba_stats = nba_stats_df[["Player", "Pos", "G", "PER"]]
reduced_nba_stats.head()

              Player Pos   G   PER
0   Precious Achiuwa   C  73  12.7
1       Steven Adams   C  76  17.6
2        Bam Adebayo   C  56  21.8
3       Santi Aldama  PF  32  10.2
4  LaMarcus Aldridge   C  47  19.6

In [30]:
reduced_nba_stats["G"].describe() 
#yielded min = 1 game, max = 82 games; mean = 37 games

count   812
mean     37
std      26
min       1
25%      12
50%      36
75%      61
max      82
Name: G, dtype: float64

In [19]:
#merge on left on name and right on player
combine_PER_Sal = reduced_nba_stats.merge(reduced_salaries, how ="inner", left_on ="Player", right_on ="Name")
combine_PER_Sal

                Player Pos   PER               Name      Salary
0     Precious Achiuwa   C  12.7   Precious Achiuwa   2711280.0
1         Steven Adams   C  17.6       Steven Adams  17073171.0
2          Bam Adebayo   C  21.8        Bam Adebayo  28103500.0
3         Santi Aldama  PF  10.2       Santi Aldama   1994520.0
4    LaMarcus Aldridge   C  19.6  LaMarcus Aldridge         NaN
..                 ...  ..   ...                ...         ...
609     Thaddeus Young  PF  15.8     Thaddeus Young  14190000.0
610         Trae Young  PG  25.4         Trae Young   8326471.0
611     Omer Yurtseven   C  17.4     Omer Yurtseven   1489065.0
612        Cody Zeller   C  17.2        Cody Zeller   1669178.0
613        Ivica Zubac   C  19.2        Ivica Zubac   7518518.0

[614 rows x 5 columns]

In [32]:
#Create bins for salary (7 bins in total)
#would it make any sense to only examine the top 10 highest paid and the
#10 lowest paid NBA players? The graph here would be cleaner and less cluttered
salary_bins = [0, 999999, 9000000, 18000000, 27000000, 36000000, 45000000, 54000000]
bin_names = ["Under a million", "1 to 9 mil", "9 to 18 mil", "18 to 27 mil",
            "27 to 36 mil", "36 to 45 mil", "Over 45 mil"]
combine_PER_Sal["Salary Categories"] = pd.cut(combine_PER_Sal["Salary"], bins = salary_bins, labels= bin_names, include_lowest = True)
#Groupby group players into their bins by salary
combine_PER_Sal.head()

              Player Pos  PER               Name   Salary Salary Categories
0   Precious Achiuwa   C   13   Precious Achiuwa  2711280        1 to 9 mil
1       Steven Adams   C   18       Steven Adams 17073171       9 to 18 mil
2        Bam Adebayo   C   22        Bam Adebayo 28103500      27 to 36 mil
3       Santi Aldama  PF   10       Santi Aldama  1994520        1 to 9 mil
4  LaMarcus Aldridge   C   20  LaMarcus Aldridge      nan               NaN